{"class_name": "Functional", "config": {"name": "Model_RoBERTa_GRU_nlpaug", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 180], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_ids"}, "name": "input_ids", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 180], "dtype": "int32", "sparse": false, "ragged": false, "name": "attention_masks"}, "name": "attention_masks", "inbound_nodes": []}, {"class_name": "TFRobertaModel", "config": {"return_dict": true, "output_hidden_states": false, "output_attentions": false, "torchscript": false, "torch_dtype": null, "use_bfloat16": false, "tf_legacy_loss": false, "pruned_heads": {}, "tie_word_embeddings": true, "is_encoder_decoder": false, "is_decoder": false, "cross_attention_hidden_size": null, "add_cross_attention": false, "tie_encoder_decoder": false, "max_length": 20, "min_length": 0, "do_sample": false, "early_stopping": false, "num_beams": 1, "num_beam_groups": 1, "diversity_penalty": 0.0, "temperature": 1.0, "top_k": 50, "top_p": 1.0, "typical_p": 1.0, "repetition_penalty": 1.0, "length_penalty": 1.0, "no_repeat_ngram_size": 0, "encoder_no_repeat_ngram_size": 0, "bad_words_ids": null, "num_return_sequences": 1, "chunk_size_feed_forward": 0, "output_scores": false, "return_dict_in_generate": false, "forced_bos_token_id": null, "forced_eos_token_id": null, "remove_invalid_values": false, "exponential_decay_length_penalty": null, "suppress_tokens": null, "begin_suppress_tokens": null, "architectures": ["RobertaForMaskedLM"], "finetuning_task": null, "id2label": {"0": "LABEL_0", "1": "LABEL_1"}, "label2id": {"LABEL_0": 0, "LABEL_1": 1}, "tokenizer_class": null, "prefix": null, "bos_token_id": 0, "pad_token_id": 1, "eos_token_id": 2, "sep_token_id": null, "decoder_start_token_id": null, "task_specific_params": null, "problem_type": null, "_name_or_path": "roberta-base", "transformers_version": "4.30.1", "model_type": "roberta", "vocab_size": 50265, "hidden_size": 768, "num_hidden_layers": 12, "num_attention_heads": 12, "hidden_act": "gelu", "intermediate_size": 3072, "hidden_dropout_prob": 0.1, "attention_probs_dropout_prob": 0.1, "max_position_embeddings": 514, "type_vocab_size": 1, "initializer_range": 0.02, "layer_norm_eps": 1e-05, "position_embedding_type": "absolute", "use_cache": true, "classifier_dropout": null}, "name": "Modelo_PreEntrenado_RoBERTa", "inbound_nodes": [[["input_ids", 0, 0, {"attention_mask": ["attention_masks", 0, 0]}]]]}, {"class_name": "GRU", "config": {"name": "Capa_GRU", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}, "name": "Capa_GRU", "inbound_nodes": [[["Modelo_PreEntrenado_RoBERTa", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "Capa_Flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "Capa_Flatten", "inbound_nodes": [[["Capa_GRU", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Capa_Densa", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Capa_Densa", "inbound_nodes": [[["Capa_Flatten", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Capa_Clasificacion", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Capa_Clasificacion", "inbound_nodes": [[["Capa_Densa", 0, 0, {}]]]}], "input_layers": [["input_ids", 0, 0], ["attention_masks", 0, 0]], "output_layers": [["Capa_Clasificacion", 0, 0]]}, "keras_version": "2.10.0", "backend": "tensorflow"}